

CREATE TABLE [dbo].[Emp_MasterReasonLeave] (
    [Id]          INT NOT NULL PRIMARY KEY IDENTITY (1, 1),
    [Reason] VARCHAR (100) NOT NULL,
	[Emp_Typesick] INT NOT NULL,
 
);

INSERT INTO [dbo].[Emp_MasterReasonLeave] ([Reason],[Emp_Typesick])
values ('ทำธุระ',1)
	  ,('กลับ/ไป ต่างจังหวัด',1)
	  ,('รถเสีย',1)
	  ,('ไม่สบาย/เป็นหวัด/ปวดหัว',2)
	  ,('ปวดหลัง/ขา',2)
	  ,('ปวดท้อง/ท้องเสีย',2)
	  ,('ทำธุระ',3)
	  ,('กลับ/ไป ต่างจังหวัด',3)
	  ,('พักร้อน',3)
	  ,('ลาคลอดบุตร',4)
	  ,('ลาไปงานศพ',4)
	  ,('ลาบวช',4)
	  ,('ภรรยาคลอดบุตร',4)
	  ,('ไม่สบาย/เป็นหวัด/ปวดหัว',5)
	  ,('ปวดหลัง/ขา',5)
	  ,('ปวดท้อง/ท้องเสีย',5)
	  ,('ทำธุระ',6)
	  ,('กลับ/ไป ต่างจังหวัด',6)
	  ,('พักร้อนฉุกเฉิน',6)
	  ,('ทำบัตรประชาชน',7)
	  ,('ทำใบขับขี่',7)
	  ,('ติดต่อหน่วยงานราชการ',7)